In [5]:
import numpy as np
import pandas as pd

In [22]:
df = pd.DataFrame({"col1": [3,4,5,np.nan], "col2": [8,np.nan,np.nan,9], "col3": [3,4,5,8], })

In [9]:
df

   col1  col3  col2
0   3.0   8.0     3
1   4.0   NaN     4
2   5.0   NaN     5
3   NaN   9.0     8

In [8]:
df.dropna()

   col1  col3  col2
0   3.0   8.0     3

In [10]:
df

   col1  col3  col2
0   3.0   8.0     3
1   4.0   NaN     4
2   5.0   NaN     5
3   NaN   9.0     8

In [11]:
df.dropna(axis=1)

   col2
0     3
1     4
2     5
3     8

In [13]:
df

   col1  col3  col2
0   3.0   8.0     3
1   4.0   NaN     4
2   5.0   NaN     5
3   NaN   9.0     8

In [16]:
df.fillna(value=0)

   col1  col3  col2
0   3.0   8.0     3
1   4.0   0.0     4
2   5.0   0.0     5
3   0.0   9.0     8

In [18]:
df

   col1  col3  col2
0   3.0   8.0     3
1   4.0   NaN     4
2   5.0   NaN     5
3   NaN   9.0     8

In [23]:
df["col2"].fillna(value=df["col1"].mean(), inplace=True)

In [24]:
df

   col1  col2  col3
0   3.0   8.0     3
1   4.0   4.0     4
2   5.0   4.0     5
3   NaN   9.0     8